app/controllers/users_controller.rb

INSERT INTO "users" ("facebook_id", "single_access_token", "last_request_at", "created_at", "crypted_password", "session_key", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES(NULL, 'J0vgki4eMIIQBFeZHmgu', '2010-03-03 19:27:06', '2010-03-03 19:27:06', '81408cabe75563a78904136c31c4439e75b527a95654f4cbfb38eb23787be5e9fe3deedc7b1a6e4e8b67378471bd38a6ec509db1d8baa9432cb24333c274e1bd', NULL, 'hpRtB3FHKJv7HUsLrsff', '2010-03-03 19:27:06', 0, '127.0.0.1', 'fjkbUh-mcoKQSZNfvLdE', '2010-03-03 19:27:06', '8063397c265949c54d74256beaae983ca8843e06db3b3890d9c60830a679009444b4652af5979cc21d22815cf81ef6bf0bae385b6f95b7cacd5289e896dd7fa8', 1, NULL, NULL, 'rcwhite@colby.edu')
---
  def create
    @user = User.new(params[:user])
    if @user.save